# Surface Distribution Rebar Handles Enumeration

Source: https://www.revitapidocs.com/2026/b04a5ee4-45d0-97b3-fcb2-7ebd7fa3ea4a.htm

---

| Surface Distribution Rebar Handles Enumeration |
| --- |

This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Surface Distribution has.
 The tag of a \[!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle
 can be obtained by calling the \[!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum SurfaceDistributionRebarHandles
```

```
Public Enumeration SurfaceDistributionRebarHandles
```

```
public enum class SurfaceDistributionRebarHandles
```

```
type SurfaceDistributionRebarHandles
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| EndSurface | 2 | Tag for handle representing the End Surface. |
| HostSurface | 0 | Tag for handle representing the Host Surface. |
| StartSurface | 1 | Tag for handle representing the Start Surface. |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace